      ***********************************************
      *AUTHOR :
      *DATE :
      *PURPOSE :
      *TECTONICS: COBC
      ***********************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           DISPLAY 'HELLO WORLD'
           STOP RUN.
       END PROGRAM YOUR-PROGRAM-NAME.
